# قم بإنشاء List تحتوي على الأرقام التالية 1, 2, 3, 3, 4, 5, 1
# قم بعمل متغير باسم unique_list ثم قم بتخزين القيم المميزة فقط من ال List السابقة.
# في السطر الأول قم بطباعة محتوى unique_list وتأكد أنها تحتوي على الأرقام المميزة فقط
# في السطر الثاني قم بطباعة نوع unique_list وتأكد أن نوع البيانات هو list
# في السطر الثالث قم بطباعة ال unique_list بدون العنصر الأخير
myList = [1, 2, 3, 3, 4, 5, 1]
unique_list = list(set(myList))
print(unique_list)
print(type(unique_list))
unique_list = unique_list[:-1]
print(unique_list)
print("=" * 30)
# 2
# قم بإنشاء Set جديدة تحتوي على الأرقام 1, 2, 3
# قم بإنشاء Set جديدة تحتوي على الحروف A, B, C
# قم بدمج ال Set الأولى والثانية بثلاث طرق مختلفة وإطبع كل طريقة في سطر
set1 = {1, 2, 3}
set2 = {"a", "b", "c"}

set3 = set(list(set1) + list(set2))
print(set3)

set3 = set(tuple(set1) + tuple(set2))
print(set3)

set3 = set1 | set2
print(set3)

set3 = set1.union(set2)
print(set3)


# 3
# قم بإنشاء Set تحتوي على العناصر 1, 2, 3
# في السطر الأول قم بطباعة محتوى ال Set
# قم بإفراغ محتوى ال Set كاملا بسطر واحد فقط ثم قم بطباعة المحتوى في السطر الثاني لتتأكد من أنها فارغة تماما
# قم بإضافة عنصرين “A”, “B” لهذه ال Set ثم إطبع محتواها في السطر الثالث
# قم بمحاولة إزالة العنصر “C” طبعا العنصر غير موجود تأكد أنه لن يخرج لك خطأ عندما تحاول إزالة العنصر الغير موجود

s1 = {1, 2, 3}
print(s1)
s1.clear()
print(s1)
s1.add("a")
s1.add("b")
print(s1)
s1.discard("c")
print(s1)
# s1.remove("c")
# print(s1)


# 4
# قم بإنشاء Set تحتوي على العناصر 1, 2, 3
# قم بإنشاء Set ثانية تحتوي على 1, 2, 3, 4, 5, 6
# # تأكد ان جميع محتويات ال Set الأولى موجود في الثانية أم لا

s2 = {1, 2, 3}
s3 = {1, 2, 3, 4, 5, 6}
print(s2.issubset(s3))

# 5
# قم بإنشاء Dictionary يحتوي على ثلاث مهارات برمجية مع النسبة المئوية لمستواك فيهم
# بدون إستخدام ال Loop قم بطباعة كل مهارة في سطر وبجانبها المستوى المكتوب بالنسبة المئوية
# قم بإضافة مهارة جديدة لل Dictionary مع النسبة المئوية الخاصة بها ثم قم بطباعتها في السطر الخامس

dis = {
    "one": "HTML Progress Is 90%",
    "two": "CSS Progress Is 80%",
    "three": "Python Progress Is 30%",
}
print(dis)
print(dis["one"])
print(dis["two"])
print(dis["three"])
