#---------Assignments For Lessons 33 To 37 -----#
# التكليف 01
# في أول 4 أسطر وبإستخدام Bool Method قم بطباعة 4 أنواع بيانات مختلفة نتيجتهم هي True
# في السطر الخامس إلى الثامن وبإستخدام Bool Method قم بطباعة 4 أنواع بيانات مختلفة نتيجتهم هي False
print(True)
print(bool("mustafa"))
print(bool(100))
print(bool(100.22))

print("="* 40)
print(bool(""))
print(bool())
print(bool([]))
print(bool({}))



# التكليف 02
# قم بإنشاء 3 متغيرات فيهم أسماء أي مهارات برمجية تمتلكها والقيمة الخاصة بهم هي نسبة تعلمك لهذه المهارات وتكون كلها فوق 50%
# في سطر واحد فقط وبواسطة ال Boolean Operators قم بالتأكد أن نسبة تعلمك في جميع المهارات أكبر من 50%
# يجب عدم إستخدام If Condition هنا ويجب إرجاع النتيجة True
print("="* 40)
html = 90
css = 100
js = 60
print( html  > 50 and css > 50 and js > 50 )

# التكليف 03
# قم بإنشاء متغير باسم num_one والقيمة الخاصة به هي رقم 10
# قم بإنشاء متغير بإسم num_two والقيمة الخاصة به هي رقم 20
# قم بإنشاء متغير ثالث بإسم num والقيمة الخاصة به هي رقم 20
# في السطر الأول قم بطباعة نتيجة فحص إذا كان المتغير num أكبر من واحد من المتغيرين الآخريين فقط وليس الإثنين
# في السطر الثاني قم بطباعة نتيجة فحص إذا كان المتغير num أكبر من المتغيرين الآخريين أم لا
print("="* 40)
num_one = 10
num_two = 20
num = 20

print(num > num_one or num > num_two)
print(num > num_one and num > num_two)


# التكليف 04
# هذا التكليف يفيدك في تطوير مستواك في إستخدام ال Methods داخل بعضها وفصل العمليات الحسابية وإستخدام الأقواس بشكل سليم ومنظم
# قم بإنشاء متغير باسم num_one والقيمة الخاصة به هي رقم 10
# قم بإنشاء متغير بإسم num_two والقيمة الخاصة به هي رقم 20
# قم بتخزين نتيجة جمع المتغيريين في متغير جديد بإسم result وقم بطباعته في السطر الأول
# في السطر الثاني قم بإيجاد نتيجة رفع الرقم لل Exponent 3
# في السطر الثالث قم بإيجاد باقي قسمة الرقم الناتج من الطلب السابق على 26000
# في السطر الرابع قم بطباعة نتيجة قسمة الرقم الناتج على 5
# تأكد أن الرقم السابق عبارة عن Float لتعرف أنك وصلت للحل بشكل سليم
# في السطر الخامس قم بطباعة النوع بعد تحويله ل String للتأكد من أنه String
num_one = 10
num_two = 20
result = num_one + num_two
print(result)
print( result ** 3 )
print(result ** 3 % 2600 )
t = result ** 3 % 2600 
print ( t / 5)
print(type(t / 5))
print(type(str(t/5)))
