# ملحوظه لما بغير الكلام لامجليزي يببقا مش مرتب فكل الشرح عربي
print("Challenge 1:")
# في هذا السطر نقوم بطباعه الاسترنج اللي هو الكلام اللي بين القوسيين
message = "This is going to be tricky ;)"
# في هذا السطر عملنا متغير اسمه مسدج وحطينا ليه قيمه وهي اللي بين الدبل كود
Message = "Very tricky!"
# في هذا السطر عملنا متغير اسمه مسدج لكنه كختلف عن اللي فوق لان الحرف الاول كابتل وبكدا يبقا المتغيير اختلف وحطينا ليه قيمه وهي اللي بين الدبل كود
print(message)
# هنا طبعنا المتغير اللي اسمع مسدج في التيرمنال
result = 3**2
# دا متغير اسمه ريزلت ليه قيمه عدديه وهي 3 مرفوع ليها اس تعني 9
print("3**2 =", result)
# هنا هنطبع في التريمنال الاسترنج اللي هو "=2**3" وقدامه قيمته اللي هي 9
result = 3 - 5
# هنا حطيت قيمه جديده للمتغير اللي اسمه  ريزلت ولو عملت يعني لو طبعت هذه القيمه هيطبع 2-
print(result)
# -في هذا السطر هيطبع 2-
print("Challenge complete!")
input("press any key to exit.........")
# في هذا السطر هيطبع الاسترنج اللي بين الدبل كود
